EmbeddedSystemClass/STM32_IMS_CONTROLLER/Source/freemodbus/port/mbport.c
								RTC_TimeStructure.RTC_Seconds=temp;

								RTC_SetTime(RTC_Format_BIN, &RTC_TimeStructure);

								iRegIndex++;
								usNRegs--;
							}
							break;

							case REG_RTC_MINUTE:
							{
								uint16_t temp=0;

								RTC_TimeTypeDef RTC_TimeStructure;
								RTC_GetTime(RTC_Format_BIN, &RTC_TimeStructure);

								((uint8_t*)(&temp))[1]=*pucRegBuffer++;
								((uint8_t*)(&temp))[0]=*pucRegBuffer++;

								RTC_TimeStructure.RTC_Minutes=temp;

								RTC_SetTime(RTC_Format_BIN, &RTC_TimeStructure);

								iRegIndex++;
								usNRegs--;
							}
							break;

							case REG_RTC_HOUR:
							{
								uint16_t temp=0;

								RTC_TimeTypeDef RTC_TimeStructure;
								RTC_GetTime(RTC_Format_BIN, &RTC_TimeStructure);

								((uint8_t*)(&temp))[1]=*pucRegBuffer++;
								((uint8_t*)(&temp))[0]=*pucRegBuffer++;

								RTC_TimeStructure.RTC_Hours=temp;

								RTC_SetTime(RTC_Format_BIN, &RTC_TimeStructure);

								iRegIndex++;
								usNRegs--;
							}
							break;

							case REG_RTC_DAY_OF_MONTH:
							{
								uint16_t temp=0;

								RTC_DateTypeDef RTC_DateStructure;
								RTC_GetDate(RTC_Format_BIN, &RTC_DateStructure);

								((uint8_t*)(&temp))[1]=*pucRegBuffer++;
								((uint8_t*)(&temp))[0]=*pucRegBuffer++;

								RTC_DateStructure.RTC_Date=temp;

								RTC_SetDate(RTC_Format_BIN, &RTC_DateStructure);

								iRegIndex++;
								usNRegs--;
							}
							break;

							case REG_RTC_MONTH:
							{
								uint16_t temp=0;

								RTC_DateTypeDef RTC_DateStructure;
								RTC_GetDate(RTC_Format_BIN, &RTC_DateStructure);

								((uint8_t*)(&temp))[1]=*pucRegBuffer++;
								((uint8_t*)(&temp))[0]=*pucRegBuffer++;

								RTC_DateStructure.RTC_Month=temp;

								RTC_SetDate(RTC_Format_BIN, &RTC_DateStructure);

								iRegIndex++;
								usNRegs--;
							}
							break;

							case REG_RTC_YEAR:
							{
								uint16_t temp=0;

								RTC_DateTypeDef RTC_DateStructure;
								RTC_GetDate(RTC_Format_BIN, &RTC_DateStructure);

								((uint8_t*)(&temp))[1]=*pucRegBuffer++;
								((uint8_t*)(&temp))[0]=*pucRegBuffer++;

								RTC_DateStructure.RTC_Year=temp;

								RTC_SetDate(RTC_Format_BIN, &RTC_DateStructure);

								iRegIndex++;
								usNRegs--;
							}
							break;

							case REG_RTC_DAY_OF_WEEK:
							{
								uint16_t temp=0;

								RTC_DateTypeDef RTC_DateStructure;
								RTC_GetDate(RTC_Format_BIN, &RTC_DateStructure);

								((uint8_t*)(&temp))[1]=*pucRegBuffer++;
								((uint8_t*)(&temp))[0]=*pucRegBuffer++;

								RTC_DateStructure.RTC_WeekDay=temp;

								RTC_SetDate(RTC_Format_BIN, &RTC_DateStructure);

								iRegIndex++;
								usNRegs--;
							}
							break;

							case REG_TCXO_FREQ:
							{
								uint32_t temp=0;
								stControllerSettings stSettingsCopy;

								((uint8_t*)(&temp))[1]=*pucRegBuffer++;
								((uint8_t*)(&temp))[0]=*pucRegBuffer++;
								((uint8_t*)(&temp))[3]=*pucRegBuffer++;
								((uint8_t*)(&temp))[2]=*pucRegBuffer++;

								if((temp>=TCXO_FREQ_MIN) && (temp<=TCXO_FREQ_MAX))
								{
									 xSemaphoreTake( xSettingsMutex, portMAX_DELAY );
									 {
									     stSettings.TCXO_frequency=temp;
									     stSettingsCopy=stSettings;
									 }
									 xSemaphoreGive( xSettingsMutex );

									 FRAM_Write_Settings(stSettingsCopy);
								}

								iRegIndex+=2;
								usNRegs-=2;
							}
							break;
//---------------------------------------------------------------------------------------------------------
							case REG_CUR0_CODE_PNT0:
							{
								uint32_t temp=0;
								stControllerSettings stSettingsCopy;

								((uint8_t*)(&temp))[1]=*pucRegBuffer++;
								((uint8_t*)(&temp))[0]=*pucRegBuffer++;
								((uint8_t*)(&temp))[3]=*pucRegBuffer++;
								((uint8_t*)(&temp))[2]=*pucRegBuffer++;

								if((temp>=REG_CUR_CODE_MIN) && (temp<=REG_CUR_CODE_MAX))
								{
									 xSemaphoreTake( xSettingsMutex, portMAX_DELAY );
									 {
									     stSettings.CurChannelCalibrate[CURRENT_CHANNEL_0].code_pnt0=temp;
									     stSettingsCopy=stSettings;
									 }
									 xSemaphoreGive( xSettingsMutex );

									 FRAM_Write_Settings(stSettingsCopy);
								}

								iRegIndex+=2;
								usNRegs-=2;
							}
							break;

							case REG_CUR0_MA_PNT0:
							{
								float temp=0;
								stControllerSettings stSettingsCopy;

								((uint8_t*)(&temp))[1]=*pucRegBuffer++;
								((uint8_t*)(&temp))[0]=*pucRegBuffer++;
								((uint8_t*)(&temp))[3]=*pucRegBuffer++;
								((uint8_t*)(&temp))[2]=*pucRegBuffer++;

								if((temp>=REG_CUR_MA_MIN) && (temp<=REG_CUR_MA_MAX))
								{
									 xSemaphoreTake( xSettingsMutex, portMAX_DELAY );
									 {
									     stSettings.CurChannelCalibrate[CURRENT_CHANNEL_0].current_4ma=temp;
									     stSettingsCopy=stSettings;
									 }
									 xSemaphoreGive( xSettingsMutex );

									 FRAM_Write_Settings(stSettingsCopy);
								}

								iRegIndex+=2;
								usNRegs-=2;
							}
							break;


							case REG_CUR0_CODE_PNT1:
							{
								uint32_t temp=0;
								stControllerSettings stSettingsCopy;

								((uint8_t*)(&temp))[1]=*pucRegBuffer++;
								((uint8_t*)(&temp))[0]=*pucRegBuffer++;
								((uint8_t*)(&temp))[3]=*pucRegBuffer++;
								((uint8_t*)(&temp))[2]=*pucRegBuffer++;

								if((temp>=REG_CUR_CODE_MIN) && (temp<=REG_CUR_CODE_MAX))
								{
									 xSemaphoreTake( xSettingsMutex, portMAX_DELAY );
									 {
									     stSettings.CurChannelCalibrate[CURRENT_CHANNEL_0].code_pnt1=temp;
									     stSettingsCopy=stSettings;
									 }
									 xSemaphoreGive( xSettingsMutex );

									 FRAM_Write_Settings(stSettingsCopy);
								}

								iRegIndex+=2;
								usNRegs-=2;
							}
							break;

							case REG_CUR0_MA_PNT1:
							{
								float temp=0;
								stControllerSettings stSettingsCopy;

								((uint8_t*)(&temp))[1]=*pucRegBuffer++;
								((uint8_t*)(&temp))[0]=*pucRegBuffer++;
								((uint8_t*)(&temp))[3]=*pucRegBuffer++;
								((uint8_t*)(&temp))[2]=*pucRegBuffer++;

								if((temp>=REG_CUR_MA_MIN) && (temp<=REG_CUR_MA_MAX))
								{
									 xSemaphoreTake( xSettingsMutex, portMAX_DELAY );
									 {
									     stSettings.CurChannelCalibrate[CURRENT_CHANNEL_0].current_20ma=temp;
									     stSettingsCopy=stSettings;
									 }
									 xSemaphoreGive( xSettingsMutex );

