EmbeddedSystemClass/STM32_IMS_CONTROLLER/Source/freemodbus/port/mbport.c
									 FRAM_Write_Settings(stSettingsCopy);
								}

								iRegIndex+=2;
								usNRegs-=2;
							}
							break;
//------------------------------------------------------------------------------------------------------------------
							case REG_CUR7_CODE_PNT0:
							{
								uint32_t temp=0;
								stControllerSettings stSettingsCopy;

								((uint8_t*)(&temp))[1]=*pucRegBuffer++;
								((uint8_t*)(&temp))[0]=*pucRegBuffer++;
								((uint8_t*)(&temp))[3]=*pucRegBuffer++;
								((uint8_t*)(&temp))[2]=*pucRegBuffer++;

								if((temp>=REG_CUR_CODE_MIN) && (temp<=REG_CUR_CODE_MAX))
								{
									 xSemaphoreTake( xSettingsMutex, portMAX_DELAY );
									 {
										 stSettings.CurChannelCalibrate[CURRENT_CHANNEL_7].code_pnt0=temp;
										 stSettingsCopy=stSettings;
									 }
									 xSemaphoreGive( xSettingsMutex );

									 FRAM_Write_Settings(stSettingsCopy);
								}

								iRegIndex+=2;
								usNRegs-=2;
							}
							break;

							case REG_CUR7_MA_PNT0:
							{
								float temp=0;
								stControllerSettings stSettingsCopy;

								((uint8_t*)(&temp))[1]=*pucRegBuffer++;
								((uint8_t*)(&temp))[0]=*pucRegBuffer++;
								((uint8_t*)(&temp))[3]=*pucRegBuffer++;
								((uint8_t*)(&temp))[2]=*pucRegBuffer++;

								if((temp>=REG_CUR_MA_MIN) && (temp<=REG_CUR_MA_MAX))
								{
									 xSemaphoreTake( xSettingsMutex, portMAX_DELAY );
									 {
										 stSettings.CurChannelCalibrate[CURRENT_CHANNEL_7].current_4ma=temp;
										 stSettingsCopy=stSettings;
									 }
									 xSemaphoreGive( xSettingsMutex );

									 FRAM_Write_Settings(stSettingsCopy);
								}

								iRegIndex+=2;
								usNRegs-=2;
							}
							break;


							case REG_CUR7_CODE_PNT1:
							{
								uint32_t temp=0;
								stControllerSettings stSettingsCopy;

								((uint8_t*)(&temp))[1]=*pucRegBuffer++;
								((uint8_t*)(&temp))[0]=*pucRegBuffer++;
								((uint8_t*)(&temp))[3]=*pucRegBuffer++;
								((uint8_t*)(&temp))[2]=*pucRegBuffer++;

								if((temp>=REG_CUR_CODE_MIN) && (temp<=REG_CUR_CODE_MAX))
								{
									 xSemaphoreTake( xSettingsMutex, portMAX_DELAY );
									 {
										 stSettings.CurChannelCalibrate[CURRENT_CHANNEL_7].code_pnt1=temp;
										 stSettingsCopy=stSettings;
									 }
									 xSemaphoreGive( xSettingsMutex );

									 FRAM_Write_Settings(stSettingsCopy);
								}

								iRegIndex+=2;
								usNRegs-=2;
							}
							break;

							case REG_CUR7_MA_PNT1:
							{
								float temp=0;
								stControllerSettings stSettingsCopy;

								((uint8_t*)(&temp))[1]=*pucRegBuffer++;
								((uint8_t*)(&temp))[0]=*pucRegBuffer++;
								((uint8_t*)(&temp))[3]=*pucRegBuffer++;
								((uint8_t*)(&temp))[2]=*pucRegBuffer++;

								if((temp>=REG_CUR_MA_MIN) && (temp<=REG_CUR_MA_MAX))
								{
									 xSemaphoreTake( xSettingsMutex, portMAX_DELAY );
									 {
										 stSettings.CurChannelCalibrate[CURRENT_CHANNEL_7].current_20ma=temp;
										 stSettingsCopy=stSettings;
									 }
									 xSemaphoreGive( xSettingsMutex );

									 FRAM_Write_Settings(stSettingsCopy);
								}

								iRegIndex+=2;
								usNRegs-=2;
							}
							break;
//------------------------------------------------------------------------------------------------------------------
							default:
							{
								usNRegs--;
							}
							break;
						}
				}
			}
			break;
        }
    }
    else
    {
        eStatus = MB_ENOREG;
    }
    return eStatus;
}



eMBErrorCode
eMBRegCoilsCB( UCHAR * pucRegBuffer, USHORT usAddress, USHORT usNCoils, eMBRegisterMode eMode )
{
    ( void )pucRegBuffer;
    ( void )usAddress;
    ( void )usNCoils;
    ( void )eMode;
    return MB_ENOREG;
}


eMBErrorCode
eMBRegDiscreteCB( UCHAR * pucRegBuffer, USHORT usAddress, USHORT usNDiscrete )
{
    ( void )pucRegBuffer;
    ( void )usAddress;
    ( void )usNDiscrete;
    return MB_ENOREG;
}

#define FILE_0	0

#define MB_FRAM_REG_LEN						( CONTROLLER_MEASURE_DATA_LEN + TIMESTAMP_LEN )

eMBErrorCode    eMBFileCB( UCHAR * pucFileBuffer, xMBReadFileRequest* xReadFileRequest, USHORT usNFiles )
{
	eMBErrorCode    eStatus = MB_ENOERR;
	eErrorCode		buf_err=ENOERR;
	USHORT file_cnt=0,reg_cnt=0;
	UCHAR reg_buf[MB_FRAM_REG_LEN];

	for(file_cnt=0;file_cnt<usNFiles;file_cnt++)
	{
		switch(xReadFileRequest[file_cnt].usFileNum)
		{
			case FILE_0:
			{
				for(reg_cnt=xReadFileRequest[file_cnt].usStartAddress;reg_cnt<(xReadFileRequest[file_cnt].usStartAddress+xReadFileRequest[file_cnt].usRegNum);reg_cnt++)
				{
					*pucFileBuffer++=MB_FRAM_REG_LEN+1;
					*pucFileBuffer++=0x6;
					buf_err=Log_Read_LogEntry(reg_cnt,reg_buf);

					if(buf_err==ENOERR)
					{
						UCHAR i=0;
						for(i=0;i<MB_FRAM_REG_LEN;i++)
						{
							*pucFileBuffer++=reg_buf[i];
						}
					}
					else
					{
						eStatus=MB_ENOREG;
					}
				}
			}
			break;

			default:
			{
				eStatus=MB_ENOREG;
			}
			break;
		}
	}
	return eStatus;
}
